{
	"id" : 1,
	"name" : "AngularJS",
	"path" : "AngularJS-address",
	"author" : "Andrew Kralovec",
	"Private" : false,
	"Associated Term" : "",
	"Registration Dates" : "",
	"Levels" : "",
	"Location" : "",
	"Credits" : "",
	"TextAssignment" : "Pro AngularJS by A. Freeman",
	"Thumbnail" : "AngularJS.png",
  "description" : "Learn to build web apps using AngularJS 2.x. By the end of the course, you'll be able to use AngularJS to create your own apps.",
	"RecentPost" : {
		"TimeStamp" : "",
		"Title" : "",
		"Thumbnail" : "",
		"path" : "",
		"description" : ""
	},
	"keys" : [
	],
	"Posts" : [
		{
			"id" : 0,
			"filename" : "FileName.png",
			"savename" : "file-1453095651163",
			"filetype" : "image/png",
			"Thumbnail" : "",
			"path" : "First-assignment-address",
      "Caption":"Assignment One \n",
			"description" : "This is our first Assignment. The best way to get started with AngularJS is to dive in and create a web application. In this Assignment you will be require to set up your environment for AngularJS",
      "Post":{
        "Title" : "First Assignment",
        "Image" : "GettingReady.png",
        "Author" : "Andrew Kralovec",
        "timestamp" : "Feb 28, 2016 at 10:00 PM",
        "Content":"Part 1: Getting ReadyPart 1 of this Assignment provides the information you need to get ready for the rest of the Assignment. It includes this chapter andprimers/refreshers for HTML, CSS, and JavaScript. I also show you how to build your first AngularJS application andtake you through the process of building a more realistic application, called SportsStore.Part 2: Working with AngularJSPart 2 of this Assignment takes you through the features of the AngularJS library, starting with an overview of the differenttypes of components in an AngularJS application and then working through each type in turn. AngularJS includesa lot of built-in functionality, which I describe in depth, and provides endless customization options, all of whichI demonstrate.Part 3: AngularJS Modules and ServicesPart 3 of this Assignment explains the roles that two important components play in AngularJS: modules and services. I showyou the different ways you can create both components and explain the wide range of built-in services that AngularJSprovides. This includes support for simplifying Single-Page Application development, Ajax and RESTful APIs, andunit testing.",
        "Files":[
          {"Name":"Fake File ", "Type":"DOCX"}
        ],
				"Comments":[
					{
						"TimeStamp":"Feb 29, 2016 at 1:00 PM",
						"Content":"Does anyone know where i should save the AngularJS script?"
					}
				]
      }
		},
		{
			"id" : 1,
			"filename" : "Next.png",
			"savename" : "file-1453095651163",
			"filetype" : "image/png",
			"Thumbnail" : "",
			"name" : "Second Assignment",
			"image" : "PuttingIntoContext.png",
			"author" : "Andrew Kralovec",
			"timestamp" : "March 28, 2016 at 11:00 PM",
			"path" : "Second-assignment-address",
      "Caption":"Assignment Two \n",
			"description" : "This is our second Assignment. I put AngularJS in context within the world of web app development during our last lession. In this Assignment you have to exaplin how AngularJS brings tools and capabilities that have been available only for server-side development to the web client and, in doing so, make it easier to develop, test, and maintain rich and complex web applications."
		},
		{
			"id" : 2,
			"filename" : "Third.png",
			"savename" : "file-1453095651163",
			"filetype" : "image/png",
			"Thumbnail" : "",
			"name" : "AngularJS Features",
			"image" : "JavaScriptPrimer.png",
			"author" : "Andrew Kralovec",
			"timestamp" : "March 31, 2016 at 11:00 PM",
			"path" : "Thrid-Post-address",
      "Caption":"Lesson One \n",
			"description" : "In this less i will provide a quick tour of the most important features of the JavaScript language, as they apply to thisAssignment. I don’t have the space to describe JavaScript completely, but I have focused on the essentials that you’ll needto get up to speed and follow the examples in this Assignment. In addition to the most important core JavaScript languagefeatures, I describe the set of utility methods that AngularJS provides."
		}
	],
	"Quizzes" : [
		{
			"id" : 0,
			"name" : "Intro quiz",
			"path" : "Intro-Quiz-address"
		}
	]
}
